Revit 2024 API
ParameterTypeId.IfcProjectGuid Property
 "IfcProject GUID"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId IfcProjectGuid { get; }
Visual Basic
Public Shared ReadOnly Property IfcProjectGuid As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ IfcProjectGuid {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace